const data = [
  {
    photo:
      "https://raw.githubusercontent.com/sovannarot/learn/main/assets/img/Picsart_24-05-03_20-05-59-822.png",
    name: "SQ3R Technique",
    date: "03/05/2024",
    about:
      "SQ3R Technique​ ជាវិធីរៀនសូត្រម្យ៉ាងដែលប្រើសម្រាប់អោយយើងអាចអានសៀវភៅចងចាំនិងចេះបានប្រសិទ្ធផលខ្ពស់ក្នុងការរៀនដោយអានសៀវភៅ។ វិធីនេះត្រូវបានប្រើដោយសិស្សជាច្រើនដែលចូលចិត្តរៀនតាមការអានសៀវភៅ",
    use: "<article>វិធីនេះមាន៥ជំហានត្រូវអនុវត្តតាមគឺ៖</article><article>-ជំហានទី១. ការចង់រៀនពីអត្ថបទ៖ សម្លឹងមើលអត្ថបទ និងស្វែងរកគោលគំនិតសំខាន់ពីអត្ថបទ។​ តើអ្វីដែលខ្ញុំអាចរៀនពីអក្សរទាំងនេះ ?</article><article>-ជំហានទី២. សួរសំណួរ៖​ គិតពីអ្វីដែលអ្នកត្រៀមខ្លួនដឹងពីប្រធានបទ។ តើអ្វីខ្ញុំសង្ឃឹមរៀនពីអក្សរទាំងនេះ ?</article><article>-ជំហានទី៣. ការអាន៖ អានសម្រាប់ឆ្លើយទៅសំណួររបស់អ្នក។</article><article>-ជំហានទី៤. ការសូត្រ៖ ពិចារណាអ្វីអ្នកចង់ចងចាំពីព័ត៏មានលម្អិតនេះ។</article><article>-ជំហានទី៥. ការរំលឹកឡើងវិញ៖ អានឡើងវិញនូវការកត់ត្រារបស់អ្នក និងភ្ជាបើព័ត៏មាននោះជាមួយបទពិសោធន៍របស់អ្នក។</article>",
    bonus: "ចង់បានប្រសិទ្ធល្អត្រូវអនុវត្តដោយយកចិត្តទុកដាក់។",
  },
  {
    photo:
      "https://raw.githubusercontent.com/sovannarot/learn/main/assets/img/feynman.avif",
    name: "Feynman Technique",
    date: "18/04/2024",
    about:
      "The Feynman Technique គឺជាវិធីសាស្រ្តដ៏មានប្រសិទ្ធភាពបំផុតដើម្បីបញ្ចេញសក្តានុពលរបស់អ្នក និងអភិវឌ្ឍការយល់ដឹងយ៉ាងស៊ីជម្រៅ។The Feynman Technique ក៏ជាដំណើរការបួនជំហានសម្រាប់ការយល់ដឹងអំពីប្រធានបទណាមួយ។ បច្ចេកទេសនេះបដិសេធការរំលឹកឡើងវិញដោយស្វ័យប្រវត្តិ នៅក្នុងការពេញចិត្តនៃការយល់ដឹងពិតប្រាកដដែលទទួលបានតាមរយៈការជ្រើសរើស ការស្រាវជ្រាវ ការសរសេរ ការពន្យល់ និងការកែលម្អ។ វិធីសាស្រ្តនេះត្រូវបានដាក់ឈ្មោះតាមលោក Richard Feynman ដែលជាជ័យលាភីពានNobel ខាងរូបវិទ្យាកង់ទិច។",
    use: "<article>វិធីនេះមាន៤ជំហានសម្រាប់អនុវត្តមានដូចតទៅ៖</article>  <article>-ជំហានទី១.ជ្រើសរើសគោលគំនិតសម្រាប់រៀន៖ តើអ្នកចង់ដឹងពីប្រធានបទអ្វី? ហើយយកក្រដាសទទេមួយសន្លឹកចេញ។ សរសេរអ្វីគ្រប់យ៉ាងដែលអ្នកដឹងរួចហើយអំពីប្រធានបទដែលអ្នកចង់យល់កាន់តែស៊ីជម្រៅ។ នៅពេលអ្នកស្វែងយល់បន្ថែមអំពីប្រធានបទ សូមបញ្ចូលវាទៅក្នុងសន្លឹករបស់អ្នក។ ប្រសិនបើអ្នកប្រើប៊ិចពណ៌ផ្សេងនៅពេលអ្នករៀនអ្វីថ្មីៗ អ្នកអាចមើលចំណេះដឹងរបស់អ្នករីកចម្រើន។នៅពេលដែលអ្នកគិតថាអ្នកយល់ប្រធានបទនេះបានល្អហើយ សូមបន្តទៅជំហានទី២។ </article> <article>-ជំហានទី២.បង្រៀនវាដល់កុមារ៖ តើអ្នកអាចពន្យល់ពីគោលគំនិតដែលអ្នកបានជ្រើសរើសទៅក្មេងអាយុ ១២ ឆ្នាំបានទេ? សាកល្បងការយល់ដឹងរបស់អ្នកដោយធ្វើឱ្យចំណាំរបស់អ្នកងាយស្រួល។ ហាម​ប្រើ​ពាក្យ​ពេចន៍ និង​ភាពស្មុគស្មាញ ដោយ​ប្រើ​តែ​ពាក្យ​ដែល​ក្មេង​អាច​យល់បាន។ ភាពសាមញ្ញបង្ហាញពីជម្រៅនៃការយល់ដឹង ខណៈពេលដែលពាក្យចចាមអារ៉ាមជារឿយៗលាក់បាំងភាពល្ងង់ខ្លៅ។ជំនួសពីក្មេង១២ឆ្នាំអ្នកអាចយកទៅបង្រៀនអ្នកដែលមិនចេះសោះពីវា។<u style='color: red; font-weight: 700;'>នរណាម្នាក់អាចបង្កើតប្រធានបទស្មុគស្មាញបាន ប៉ុន្តែមានតែអ្នកដែលយល់ទេ ទើបអាចធ្វើឱ្យវាសាមញ្ញបាន។</u></article> <article>  -ជំហានទី៣.ពិនិត្យ និងកែលម្អ៖ សរសេរការពន្យល់សាមញ្ញរបស់អ្នក។ សកម្មភាពនៃ ការសរសេរជំនួយការឆ្លុះបញ្ចាំង និងការរៀន។ តាមពិត ការឆ្លុះបញ្ចាំងគឺជាផ្នែកសំខាន់បំផុតនៃដំណើរការសិក្សា។ ការឆ្លុះបញ្ចាំងគឺជារបៀបដែលយើងរៀនអ្វីដែលយើងដឹងនិងអ្វីដែលយើងត្រូវរៀន។ ការសរសេរច្បាស់លាស់ផ្តល់នូវការគិតមិនល្អ គ្មានកន្លែងដែលត្រូវលាក់។។ត្រូវប្រាកដថាកំណត់ចំណាំរបស់អ្នកមិនមានពាក្យចចាមអារ៉ាម ឬអ្វីមួយដែលស្តាប់ទៅគួរឱ្យយល់ច្រឡំ។ ត្រូវប្រាកដថាកំណត់ចំណាំរបស់អ្នកមិនមានពាក្យចចាមអារ៉ាម ឬភាពស្មុគ្រស្មាញដែលចែងចាំង។ ប្រសិនបើមានអ្វីមួយស្តាប់ទៅដូចជាច្របូកច្របល់ វាត្រូវការការកែលម្អបន្ថែមទៀត។អានវាឱ្យខ្លាំង ៗ ដូចជាកុមារ។ ប្រសិនបើការពន្យល់មិនសាមញ្ញគ្រប់គ្រាន់ ឬស្តាប់ទៅយល់ច្រលំ នោះជាសញ្ញាល្អដែលអ្នកត្រូវឆ្លុះបញ្ចាំង និងកែលម្អ។ ត្រលប់ទៅសម្ភារៈប្រភព ដោយពិនិត្យមើលផ្នែកដែលអ្នកមិនទាន់យល់ច្បាស់នៅឡើយ។ធ្វើម្តងទៀតរហូតដល់អ្នកមានការពន្យល់សាមញ្ញ។</article> <article>ជំហានទី៤.រៀបចំនិងពិនិត្យឡើងវិញ៖ដើម្បីសាកល្បងការយល់ដឹងរបស់អ្នកនៅក្នុងពិភពពិត សូមបង្ហាញការពន្យល់របស់អ្នកទៅកាន់អ្នកផ្សេង។ តើការពន្យល់របស់អ្នកមានប្រសិទ្ធភាពប៉ុណ្ណា? តើពួកគេបានសួរសំណួរអ្វីខ្លះ? តើពួកគេយល់ច្រឡំអំពីផ្នែកអ្វីខ្លះ?នៅពេលអ្នកសប្បាយចិត្តនឹងការយល់ដឹងរបស់អ្នក សូមយកទំព័រដែលអ្នកបានបង្កើតជាមួយនឹងការពន្យល់សាមញ្ញមួយ ហើយដាក់វាចូលទៅក្នុងឯកសារចង។ ការធ្វើតាមបច្ចេកទេសនេះសម្រាប់អ្វីគ្រប់យ៉ាងដែលអ្នករៀនផ្តល់ឱ្យអ្នកនូវឯកសារភ្ជាប់ពេញលេញនៃការរៀនដែលអ្នកអាចពិនិត្យឡើងវិញពីរបីដងក្នុងមួយឆ្នាំ។</article>",
    bonus:
      'ភាពសាមញ្ញ គឺជាចំណុចសំខាន់នៃការយល់ដឹងពិត។ ប្រកួតប្រជែងជាមួយអ្នកដទៃដែលប្រើភាសាដើម្បីពន្យល់អំពីគោលគំនិតក្នុងន័យសាមញ្ញ ហើយប្រតិកម្មរបស់ពួកគេអាចបង្ហាញពីការយល់ដឹងរបស់ពួកគេ (ឬកង្វះវា)។ តាមពាក្យអ្នកវិទ្យាសាស្រ្តរូបវិទ្យាដ៏អស្ចារ្យគឺលោកអាល់បឺត អែងស្តែង (Albert Einstein)បាននិយាយថា៖ "ប្រសិនបើអ្នកមិនអាចពន្យល់វាឱ្យសាមញ្ញទេ គឺមានន័យថាអ្នកមិនយល់វាគ្រប់គ្រាន់ទេ"(សន្មត)',
  },
  {
    photo:
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSTpeLl2aSIb0wYG_25ZKMglGNCIpizezQNriYuRwfYiA&s",
    name: "How Brain Work ?",
    date: "19/04/2024",
    about:
      "ខួរក្បាលយើងមានអង្គចងចាំ២គឺអង្គចងចាំខ្លំនិងអង្គចងចាំវែង។ ការចងចាំនូវមេរៀនបានយូរលុះត្រាតែមេរៀននោះក្នុងអង្គចងចាំវែង ហើយការអាចឱ្យខួរក្បាលយើងចាត់ទុកមេរៀននោះក្នុងអង្គចងចាំវែងមានលុះត្រាតែមេរៀននោះខួរក្បាលចាត់ទុកថាសំខាន់។ ដើម្បីឱ្យខួរក្បាលចាត់ទុកវាសំខាន់បានលុះត្រាតែអនុវត្តតាមវិធីខាងក្រោម។",
    use: "វិធីដើម្បីឱ្យខួរក្បាលចាត់ទុកវាសំខាន់មានដូចជា៖ ត្រូវរៀននិងទន្ទេញមេរៀននោះឱ្យចាំ ហើយពេលណាមួយដែលអ្នកមិនកំពុងរៀនអ្នកត្រូវរំលឹកមេរៀននោះឡើងវិញឱ្យបានត្រឹមត្រូវនិងច្បាស់លាស់បំផុត បើអ្នករំលឹកទៅអ្នកស្រពេចស្រពិលអ្នកត្រូវបង្ខំខួរក្បាលឱ្យពេញទំហឹងឱ្យរំលឹកមេរៀននោះ រហូតអ្នកមានការព្យាយាមពេញទំហឹងហើយអ្នកនូវនឹកមិនឃើញ អ្នកត្រូវទៅបើកមើលរំលឹកមេរៀននោះពីសៀវភៅវិញុ។ អ្នកត្រូវធ្វើតាមដំណាក់កាលទាំងនេះសារជាថ្មីដដែលៗបើមានមេរៀននោះលែងសំខាន់អ្នកទៅអនុវត្តលើមេរៀនទៀតផ្សេងទៅ។",
    bonus: "អ្នកអាចអនុវត្តម្តងច្រើនមេរៀនបាន។",
  },
  {
    photo:
      "https://raw.githubusercontent.com/sovannarot/learn/main/assets/img/learningpyramid.jpg",
    name: "Learning Pyramid",
    date: "20/04/2024",
    about: "តារាងនិយាយពីកម្រិតភាគរយនៃភាពចងចាំរបស់យើង។",
    use: "<article>អ្នកត្រូវធ្វើការអនុវត្តតាមតារាងតាមដំណាក់ៗរបស់វាដែលមានដូចជា៖</article><article>ការរៀនពីគ្រូក្នុងថ្នាក់ 5%</article><article>ការអាន 10%</article><article>ការស្តាប់ហើយស្រមៃគិត 20%</article><article>ការធ្វើបទបង្ហាញ 30%</article><article>ការពិភាក្សាជាក្រុម 50%</article><article>អនុវត្តន៍ផ្ទាល់ 75%</article><article>បង្រៀនទៅអ្នកដទៃ 90% ។</article>",
    bonus: "មិនត្រូវរំលងដំណាក់កាលណាមួយទេ!",
  },
  {
    photo:
      "https://raw.githubusercontent.com/sovannarot/learn/main/assets/img/flowtime.png",
    name: "Flowtime Method",
    date: "21/04/2024",
    about:
      "តើអ្នកធ្លាប់បានផ្តោតរៀនសូត្រជាច្រើនម៉ោងដែរឬទេ​? តែបែរទៅជាមានការឈឺក្បាលនិងចាំអ្វីដែលបានរៀនតិចតួចបំផុតទៅវិញ។ នេះនែ‌៎!ខ្ញុំមានវិធីមួយមកជួយអ្នកទាំងអស់គ្នាឱ្យបានដឹងពីរបៀបជំនួសការរៀនជាច្រើនម៉ោងតែមិនបានអ្វីសោះឱ្យមករៀនសូត្រទទូលបានការចាំជាច្រើនមកវិញ។ Flowtime Techniqueនេះឯងដែលជាទិចនិចមួយមកជួយក្នុងការកំណត់ពេលផ្តោតរៀននិងពេលត្រូវសម្រាកបន្តិចដើម្បីឱ្យខួរក្បាលយើងចាប់បាននិងរៀនទទួលបានចំណេះដឹងច្រើនជាងការរៀនដោយផ្តោតរយៈពេលជាច្រើនម៉ោង។ ទិចនិចនេះត្រូវបានអនុវត្តដោយសិស្សឆ្លាតក្នុងការរៀនជាច្រើនក្នុងពិភពលោកយើងនេះដើម្បីរៀនដោយភាពវៃឆ្លាតក្នុងការប្រជែងចំណាត់ថ្នាក់និងពិន្ទុក្នុងថ្នាក់និងក្នុងការប្រលងនានា។ ទិចនិចនេះត្រូវបានអនុវត្តនិងទទួលស្គាល់ពីសិស្សានុសិស្ស និងអ្នកវិទ្យាសាស្ត្រទូទាំងពិភពលោកថាជាវិធីដ៏ល្អសម្រាប់ខួរក្បាលយើង ព្រោះវាអាចឱ្យយើងរៀនច្រើនម៉ោងដោយមិនសូវជាធុញទ្រាន់ ហត់នើយ​និង​ ខួរក្បាលមិនរងការឈឺចាប់ ហើយរៀនដោយភាពសប្បាយនិងចាំបានច្រើនទៀតផង៕",
    use: "អ្នកគ្រាន់តែចុចប៊ូតុងពាក្យចាប់ផ្តើមហើយអ្នកផ្តោតលើការរៀនអ្នកចោះ។ ពេលណាអ្នកមានធុរៈចាំបាច់អ្នកគ្រាន់តែចុចប៊ូតុងពាក្យឈប់នាឡិកានឹងឈប់ដើរចាំអ្នក​ ពេលណាអ្នកអាចបន្តរៀនទៅទៀតអ្នកគ្រាន់តែចុចប៊ូតុងពាក្យចាប់ផ្តើមវិញ។ ពិសេសពេលណាអ្នករៀនបានរយៈពេលណាមូយដែលល្អក្រោម១ម៉ោងកន្លះហើយអ្នកបាត់បង់ការផ្តោតក្នុងការរៀនអ្នកត្រូវចុចប៊ូតុងពាក្យគណនានោះនាឡិកានឹងរត់ទៅនាទីដែលអ្នកត្រូវសម្រាកដើម្បីឱ្យនាទីពេលសម្រាកដើរអ្នកត្រូវចុចប៊ូតុងចាប់ផ្តើម។សកម្មភាពទាំងអស់នេះនៅក្នុង៖ <a href='./clock.html' style='display: flex;font-size: 17px;width: 153px;height: 45px;border-radius: 20px;border: 2px white solid;background: #f81b1b;color: white;text-decoration: none;justify-content: center;align-items: center;color:yellow;'>Flowtime Timer</a>",
    bonus: "វិធីនេះត្រូវបានយល់ស្របដោយអ្នកវិទ្យាសាស្រ្ត និង​ជនកំពូលជាច្រើន។",
  },
];
let output = "";
let boll = false;
const postshow = document.getElementsByClassName("postlayout");
function showpost(index) {
  boll = !boll;
  for (let t = 0; t < postshow.length; t++) {
    if (index == t) {
      postshow[t].style.transform = "scale(1)";
      for (let x = 0; x < t; x++) {
        postshow[x].style.transform = "scale(0)";
      }
      for (let y = t + 1; y < postshow.length; y++) {
        postshow[y].style.transform = "scale(0)";
      }
    }
  }
}
function hidepost(index) {
  postshow[index].style.transform = "scale(0)";
}
function createpost(photo, name, date, index) {
  output += `
    <div class="postarticle">
      <img src="${photo}" />
      <div class="texttab">
        <div class="text">
          <h1>${name}</h1>
          <h3>Date: ${date}</h3>
        </div>
        <button onclick="showpost(${index})">Learn More</button>
      </div>
    </div>
  `;
}
for (let i = 0; i < data.length; i++) {
  createpost(data[i].photo, data[i].name, data[i].date, i);
}
document.getElementById("posttab").innerHTML = output;

let input = "";
function createpostlayout(name, photo, about, use, bonus, index) {
  input += `<div class="postlayout">
  <div class="top">
    <h2>${name}</h2>
    <div style="width: calc(100vw - 300px); height: 25px"></div>
    <button onclick="hidepost(${index})">
      <img src="https://raw.githubusercontent.com/sovannarot/learn/main/assets/img/xmark.svg" alt="" />
    </button>
  </div>
  <div class="mid">
    <img src=${photo} alt="" />
    <h2>អំពី៖</h2>
    <article>
  ${about}
    </article>
    <h2>របៀបប្រើ៖</h2>
    <article>
${use}
    </article>
    <h2>ព័ត៏មានសំខាន់៖</h2>
    <article>
    ${bonus}
    </article>
  </div>
</div>`;
}
for (let i = 0; i < data.length; i++) {
  createpostlayout(
    data[i].name,
    data[i].photo,
    data[i].about,
    data[i].use,
    data[i].bonus,
    i
  );
}
document.getElementById("postlayouttab").innerHTML = input;
